In [ ]:
import pandas as pd
df = pd.read_excel("dumyData.xlsx")
df

         town  area   price
0   ISLAMABAD  2600  550000
1   ISLAMABAD  3000  565000
2   ISLAMABAD  3200  610000
3   ISLAMABAD  3600  680000
4   ISLAMABAD  4000  725000
5    NEW CITY  2600  585000
6    NEW CITY  2800  615000
7    NEW CITY  3300  650000
8    NEW CITY  3600  710000
9         WAH  2600  575000
10        WAH  2900  600000
11        WAH  3100  620000
12        WAH  3600  695000

In [ ]:
dummies = pd.get_dummies(df.town)
dummies

    ISLAMABAD  NEW CITY  WAH
0           1         0    0
1           1         0    0
2           1         0    0
3           1         0    0
4           1         0    0
5           0         1    0
6           0         1    0
7           0         1    0
8           0         1    0
9           0         0    1
10          0         0    1
11          0         0    1
12          0         0    1

# USING GETDUMMY METHOD OF PANDAS

In [ ]:
df_dummies = pd.concat([df ,dummies], axis ="columns")
df_dummies

         town  area   price  ISLAMABAD  NEW CITY  WAH
0   ISLAMABAD  2600  550000          1         0    0
1   ISLAMABAD  3000  565000          1         0    0
2   ISLAMABAD  3200  610000          1         0    0
3   ISLAMABAD  3600  680000          1         0    0
4   ISLAMABAD  4000  725000          1         0    0
5    NEW CITY  2600  585000          0         1    0
6    NEW CITY  2800  615000          0         1    0
7    NEW CITY  3300  650000          0         1    0
8    NEW CITY  3600  710000          0         1    0
9         WAH  2600  575000          0         0    1
10        WAH  2900  600000          0         0    1
11        WAH  3100  620000          0         0    1
12        WAH  3600  695000          0         0    1

In [ ]:
df_dummies.drop(['town','ISLAMABAD','price'] ,axis = "columns", inplace =True)
df_dummies

    area  NEW CITY  WAH
0   2600         0    0
1   3000         0    0
2   3200         0    0
3   3600         0    0
4   4000         0    0
5   2600         1    0
6   2800         1    0
7   3300         1    0
8   3600         1    0
9   2600         0    1
10  2900         0    1
11  3100         0    1
12  3600         0    1

In [ ]:
X = df_dummies
Y = df.price
Y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

# NOW BUILD MODEL

In [ ]:
from sklearn.linear_model import LinearRegression

In [ ]:
model = LinearRegression()

In [ ]:
model.fit(X,Y)
# model.predict([[3400,1,0]])#predict home price in new city.
# model.score(X,Y)
# model.predict([[2800,0,0]])#predict home price in islamabad.

LinearRegression()

# USING SKLEARN  (LABLE ENCODER CLASS OF sklearn.preprocessing)

In [ ]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()
df

         town  area   price
0   ISLAMABAD  2600  550000
1   ISLAMABAD  3000  565000
2   ISLAMABAD  3200  610000
3   ISLAMABAD  3600  680000
4   ISLAMABAD  4000  725000
5    NEW CITY  2600  585000
6    NEW CITY  2800  615000
7    NEW CITY  3300  650000
8    NEW CITY  3600  710000
9         WAH  2600  575000
10        WAH  2900  600000
11        WAH  3100  620000
12        WAH  3600  695000

In [ ]:
df_le = df
df_le.town =le.fit_transform(df_le.town)
df_le

    town  area   price
0      0  2600  550000
1      0  3000  565000
2      0  3200  610000
3      0  3600  680000
4      0  4000  725000
5      1  2600  585000
6      1  2800  615000
7      1  3300  650000
8      1  3600  710000
9      2  2600  575000
10     2  2900  600000
11     2  3100  620000
12     2  3600  695000

In [ ]:
X = df_le[['town','area']].values   #.values will convert this X data in to 2D array
X

array([[   0, 2600],
       [   0, 3000],
       [   0, 3200],
       [   0, 3600],
       [   0, 4000],
       [   1, 2600],
       [   1, 2800],
       [   1, 3300],
       [   1, 3600],
       [   2, 2600],
       [   2, 2900],
       [   2, 3100],
       [   2, 3600]], dtype=int64)

In [ ]:
Y = df_le.price.values

In [ ]:
Y

array([550000, 565000, 610000, 680000, 725000, 585000, 615000, 650000,
       710000, 575000, 600000, 620000, 695000], dtype=int64)

In [ ]:
from sklearn.preprocessing import OneHotEncoder
from sklearn.compose import ColumnTransformer

# labelencoder_X = LabelEncoder()
# X[:,0] = labelencoder_X.fit_transform(X[:,0])

#Encode Country Column
ct = ColumnTransformer([("town", OneHotEncoder(), [0])], remainder = 'passthrough')
X = ct.fit_transform(X)

In [ ]:
X

array([[1.0e+00, 0.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.0e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.2e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 3.6e+03],
       [1.0e+00, 0.0e+00, 0.0e+00, 4.0e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 2.8e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.3e+03],
       [0.0e+00, 1.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 2.9e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.1e+03],
       [0.0e+00, 0.0e+00, 1.0e+00, 3.6e+03]])

In [ ]:
X = X[:,1:]

In [ ]:
X

array([[0.0e+00, 0.0e+00, 2.6e+03],
       [0.0e+00, 0.0e+00, 3.0e+03],
       [0.0e+00, 0.0e+00, 3.2e+03],
       [0.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 0.0e+00, 4.0e+03],
       [1.0e+00, 0.0e+00, 2.6e+03],
       [1.0e+00, 0.0e+00, 2.8e+03],
       [1.0e+00, 0.0e+00, 3.3e+03],
       [1.0e+00, 0.0e+00, 3.6e+03],
       [0.0e+00, 1.0e+00, 2.6e+03],
       [0.0e+00, 1.0e+00, 2.9e+03],
       [0.0e+00, 1.0e+00, 3.1e+03],
       [0.0e+00, 1.0e+00, 3.6e+03]])

In [ ]:
model.fit(X,Y)

LinearRegression()

In [ ]:
model.predict([[1,0,3400]]) #predict home price in new city.

array([681241.6684584])

In [ ]:
# model.score(X,Y)

In [ ]:
model.predict([[0,0,2800]]) #predict home price in Islamabad.

array([565089.22812298])